<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"f0b502b65fc9be76fea94e6cefc707a9a8cf1963f0ff3a39eaf6771f294b5f6b","plan_job_ref":"Job .github/workflows/terraform-plan.yml #68 at https://github.com/GradientFlow-ai/terraform/actions/runs/4793450739","plan_hash":"1171c8cb1f0b2fa1d4daed61c29cb450c5d5f05ae03a55c2282faf819fa2f462","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __.__<details open><summary>With variables</summary>

```hcl
TF_VAR_AWS_ACCESS_KEY_ID     = (sensitive value)
TF_VAR_AWS_SECRET_ACCESS_KEY = (sensitive value)
TF_VAR_VERCEL_API_TOKEN      = "oiMAmyaqs466YuOfZLbuCOEs"
```
</details>
<details>
<summary>Plan: 14 to add, 6 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repos.github_actions_secret.DATABASE_URL will be created
  + resource "github_actions_secret" "DATABASE_URL" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "eaas"
      + secret_name     = "DATABASE_URL"
      + updated_at      = (known after apply)
    }

  # module.repos.github_actions_secret.SHADOW_DATABASE_URL will be created
  + resource "github_actions_secret" "SHADOW_DATABASE_URL" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "eaas"
      + secret_name     = "SHADOW_DATABASE_URL"
      + updated_at      = (known after apply)
    }

  # module.repos.github_actions_secret.super_github_token will be created
  + resource "github_actions_secret" "super_github_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "terraform"
      + secret_name     = "SUPER_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.repos.github_actions_secret.tf_var_aws_access_key_id will be created
  + resource "github_actions_secret" "tf_var_aws_access_key_id" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "terraform"
      + secret_name = "TF_VAR_AWS_ACCESS_KEY_ID"
      + updated_at  = (known after apply)
    }

  # module.repos.github_actions_secret.tf_var_aws_secret_access_key will be created
  + resource "github_actions_secret" "tf_var_aws_secret_access_key" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "terraform"
      + secret_name = "TF_VAR_AWS_SECRET_ACCESS_KEY"
      + updated_at  = (known after apply)
    }

  # module.repos.github_actions_secret.vercel_api_token will be created
  + resource "github_actions_secret" "vercel_api_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "terraform"
      + secret_name     = "VERCEL_API_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.repos.github_branch_protection.eaas will be updated in-place
  ~ resource "github_branch_protection" "eaas" {
        id                              = "BPR_kwDOI7EyTc4CIwZR"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.embeddings_api will be updated in-place
  ~ resource "github_branch_protection" "embeddings_api" {
        id                              = "BPR_kwDOI-ZWE84CIwg4"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.fast-api-ocean will be updated in-place
  ~ resource "github_branch_protection" "fast-api-ocean" {
        id                              = "BPR_kwDOI96H_s4CIwg3"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.terraform will be updated in-place
  ~ resource "github_branch_protection" "terraform" {
        id                              = "BPR_kwDOJOQLq84CJzKa"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.roles.aws_iam_user.gh_runner will be updated in-place
  ~ resource "aws_iam_user" "gh_runner" {
        id            = "gh_runner"
        name          = "gh_runner"
      ~ tags          = {
          - "AKIATA2OA5BNZB3F3CKT" = "S3 access" -> null
        }
      ~ tags_all      = {
          - "AKIATA2OA5BNZB3F3CKT" = "S3 access"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.roles.aws_iam_user_policy.gh_runner_policy will be updated in-place
  ~ resource "aws_iam_user_policy" "gh_runner_policy" {
        id     = "gh_runner:gh_runner_policy"
        name   = "gh_runner_policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            "sts:AssumeRole",
                          - "iam:UntagUser",
                        ]
                      ~ Resource = "arn:aws:iam::207932680283:role/create_roles" -> "arn:aws:iam::207932680283:role/secrets_manager_role"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.vercel.vercel_project_environment_variable.AWS_ACCESS_KEY_ID will be created
  + resource "vercel_project_environment_variable" "AWS_ACCESS_KEY_ID" {
      + id         = (known after apply)
      + key        = "AWS_ACCESS_KEY_ID"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.AWS_SECRET_ACCESS_KEY will be created
  + resource "vercel_project_environment_variable" "AWS_SECRET_ACCESS_KEY" {
      + id         = (known after apply)
      + key        = "AWS_SECRET_ACCESS_KEY"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.GITHUB_ID will be created
  + resource "vercel_project_environment_variable" "GITHUB_ID" {
      + id         = (known after apply)
      + key        = "GITHUB_ID"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.GITHUB_SECRET will be created
  + resource "vercel_project_environment_variable" "GITHUB_SECRET" {
      + id         = (known after apply)
      + key        = "GITHUB_SECRET"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.GOOGLE_CLIENT_ID will be created
  + resource "vercel_project_environment_variable" "GOOGLE_CLIENT_ID" {
      + id         = (known after apply)
      + key        = "GOOGLE_CLIENT_ID"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.GOOGLE_CLIENT_SECRET will be created
  + resource "vercel_project_environment_variable" "GOOGLE_CLIENT_SECRET" {
      + id         = (known after apply)
      + key        = "GOOGLE_CLIENT_SECRET"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.NEXTAUTH_URL will be created
  + resource "vercel_project_environment_variable" "NEXTAUTH_URL" {
      + id         = (known after apply)
      + key        = "NEXTAUTH_URL"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.S3_BUCKET_NAME will be created
  + resource "vercel_project_environment_variable" "S3_BUCKET_NAME" {
      + id         = (known after apply)
      + key        = "S3_BUCKET_NAME"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

Plan: 14 to add, 6 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "TF_VAR_VERCEL_API_TOKEN"
but a value was found in file "/tmp/variables.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:x: Error applying plan in [Terraform Apply #35](https://github.com/GradientFlow-ai/terraform/actions/runs/4793453125)